_posts/2014-11-15-ocamldebug.html
---
layout: post
title: "ocamldebug"
date:   2014-11-15 21:00:00
categories: ocaml
---

<p>
When I first read about the time-travel feature of the ocaml debugger
I was very intrigued but never got around to trying it out in practice at
work. This weekend I decided to give it a go.
</p>

<p>
<b>Note:</b> Getting the debugger configured correctly was a bit of a hurdle and
there are still a couple of problems that I'm hoping to
resolve. Until I get these things sorted out this blog post is used
as a way to describe my setup so I can get help from some of the more
seasoned OCaml programmers out there. Once I have everything sorted
out I'll re-write this post into a proper guide as I did with my <a href="http://mads379.github.io/ocaml/2014/01/05/using-utop-in-emacs.html">utop
post</a>.
</p>

<p>
I decided to try out the debugger on the <a href="https://github.com/mirage/ocaml-cohttp/blob/master/examples/async/hello_world.ml">hello world example</a> of
<a href="https://github.com/mirage/ocaml-cohttp">ocaml-cohttp</a> to get a simple but non-trivial program (in terms of
setup, i.e. a program that requires OPAM packages to compile).
</p>

<p>
For the debugger to work properly on this example you need to make
sure that your opam packages are compiled using the <code>-g</code> option. You
can do this by setting <code>OCAMLPARAM</code> to <code>_,g</code> before running <code>opam
install</code>. You will want to run <code>opam reinstall</code> on any package you
have previously installed to make sure they get recompiled.
</p>

<p>
The second thing you need to do is tell <code>ocamldebug</code> where to look for
your compiled files. Unfortunately this is not as easy as it is with
utop. Luckily I came across this stack overflow <a href="http://stackoverflow.com/questions/6218990/how-can-ocamldebug-be-used-with-a-batteries-included-project">thread</a> which explains
how to do it. I ended up using a slightly different approach as you
can't pass arguments to <code>ocamldebug</code> when running it from within Emacs
(at least I couldn't get it to work). I decided to write the results
of <code>ocamlfind query -recursive core async cohttp cohttp.async</code> into a
file named <code>.ocamldebug</code> and prefix each line with <code>directory</code>. After
having started the debugger in Emacs I ran <code>source &lt;PATH&gt;</code> to
configure it.
</p>

<p>
I sat a breakpoint a line 6 of this <a href="https://github.com/mads379/ocaml-utop-emacs-example/blob/master/src/server.ml#L6">file</a> and wrote <code>run</code> in the
ocamldebug buffer. I executed a request to
<code>http://localhost:8080/test?hello=xyz%27</code> and successfully hit the
breakpoint. I was able to inspect the value of <code>req</code> using <code>C-x C-a
C-p</code> but as soon as I wrote <code>step</code> in the debugger I got the following
error.
</p>

<pre>(ocd) step
Time: 1084742 - pc: 4416712 - module Cohttp.Request
No source file for Cohttp.Request.</pre>

<p>
Any idea why I would be able to find the other modules of <code>cohttp</code> but
not this one?
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Wish List</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Is it possible to execute arbitrary OCaml code using the scope of
the current breakpoint?
</li>
</ul>
</div>
</div>
